package com.example.myontheway01;
/**
 * myOnTheWay04已完成功能：
 * 1.欢迎界面
 * 2.导航界面
 * 3.主页框架
 * 4.侧滑界面
 * 5.手机验证码注册或重置密码
 *   手机号或用户名登录
 *   记住密码
 * 6.新闻的fragment
 * myOnTheWay05实现功能：
 * 1.验证是否是首次下载，若首次进入，由欢迎界面跳转至导航界面，若非首次进入，由欢迎界面跳转至主界面
 * 2.实现QQ的第三方登录
 * myOnTheWay06实现功能：
 * 1.实现了地图搜索附近的功能   %%导航功能未完成
 * myOnTheWay07实现功能：
 * 1.主页显示，上拉下刷   %%上拉加载卡顿
 * myOnTheWay08实现功能：
 * 1.发表帖子，并在动态fragment中实时显示出来
 * myOnTheWay09实现功能：
 * 1.评论并显示出来
 * myOnTheWay09_1：
 * 1.侧滑添加内容
 * 2.添加地图功能
 * MyTrip01:
 * 1.可以发帖子，发表评论
 * MyTrip02:
 * 1.回复评论的功能
 * MyTrip03,04:
 * 1.点赞功能 写入数据库成功  显示有bug（使用多对多）
 * MyTrip05:
 * 1.建一张点赞表，点赞功能换一种方式实现（一对多，类似帖子和评论）
 * MyTrip10:
 * 1.用户资料编辑 UI美化  
 * */
public class Update {

}
