package com.byzx.myhotel;
/**
 * 
 * myhotel01新增功能
 *   1.登录设置点击事件
 *   2.提取出xml中的文本、尺寸、颜色、样式
 *   3.点击登录页面的注册跳转到注册见面
 *   4.规范id命名
 * myHotel02新增功能
 *   1.实现注册功能（保存到一个文件）
 *   2.实现登录功能
 * myHotel03新增功能
 *   1.记住密码
 *   2.提取出文本内容（如”登录“ ”请输入密码“）
 * myHotel04新增功能
 *   1.使用SQlite数据库来存储注册数据和验证登录
 * myHotel05新增功能
 *   1.登录进入主界面 
 * myHotel06新增功能
 *   1.主界面点击不同按钮会跳转到不同的界面
 * myHotel07新增功能
 *   1.点击不同的房间类型按钮，将数据库中不同的内容传入到房间详情的页面中去
 * myHotel08 新增功能
 *   1.显示不同房间类型的房号
 * myHotel09 新增功能
 *   1.完成入住登记界面
 *   2.将房间号码和房间价格在入住登记界面显示
 * myHotel10
 *   1.填写入住登记信息（未填写时提示错误）
 *   2.将登记信息写入到数据库，写入成功提示
 *   3.密码不能少于6位，且用户名不能重复
 * myHotel11
 *   1.将入住的房间设置为不可编辑
 *     (第一种方法：1.查询出所有的按钮
 *               2.将其中状态为1即入住的房间改为不可编辑)
 * myHotel11_1
 *   1.将入住的房间设置为不可编辑
 *     (第二种方法：1.创建一个RoomNumBean的类，存放房间号和入住状态
 *               2.将其对象存入到一个list集合
 *               3.根据状态设置按钮的类型)
 * myHotel12
 *   1.查询出所有已经登记入住的房客信息
 * myHotel12_2
 *   1.通过姓名查询出已经登记入住的房客信息
 * myHotel13
 *   1.实现退房逻辑（在查询入住信息的按钮）
 * myHotel14
 *   1.实现外部退房，根据房间号查询
 *   2.实现入住历史的查询
 * @author LYJ
 * */
public class Update {
   public static void showUpdateDetail(){
	   
   }
}
